#!/usr/bin/python
# vim: set fileencoding=utf-8 :
# vim: et:ts=4:sw=4:sts=4
def fix_accents(text):
    ACCENT_REPLACE = [
         # :
         [":a", "ä"],
         [":o", "ö"],
         [":u", "ü"],

         [":U", "Ü"],

         # ,
         [",a", "á"],
         [",e", "é"],
         [",i", "í"],
         [",o", "ó"],
         [",u", "ú"],
         [",y", "ý"],

         [",E", "é"],

         [",r", "ŕ"],
         [",l", "ĺ"],

         # >
         [">c", "č"],
         [">d", "ď"],
         [">l", "ľ"],
         [">n", "ň"],
         [">s", "š"],
         [">t", "ť"],
         [">z", "ž"],

         [">C", "Č"],
         [">D", "Ď"],
         [">L", "Ľ"],
         [">N", "Ň"],
         [">S", "Š"],
         [">T", "Ť"],
         [">Z", "Ž"],

         # ^
         ["^e", "ê"],
         ["^o", "ô"],
         ["^a", "â"],

         # `
         ["`a", "à"],
         ["`e", "è"],

         ["`E", "È"],

         # other
         ["SS", "ß"],
         ["+c" ,"ç"],
         ["+C" ,"Ç"],
    ]
    for entry in ACCENT_REPLACE:
        text = text.replace(entry[0], entry[1])
    return text
